/**
 *
 * 問題1. 今答えが30となっているところを40に出力を変更してください。
 *
 */
const testFunction1 = () => {
  // テスト開始の合図です。
  console.log('****問題1の計算を開始します。**** ');

  // ****************この中を修正してください。***************

  let box1 = 10;
  let box2 = 20;

  // ****************************************************

  // 問題1の結果を返します。
  console.log(box1 + box2);
  console.log('****問題1の計算を終了します。**** ');
};

// ここで実行してます。ここは触らないでください。
testFunction1();

/**
 *
 * 問題2. 今答えが30となっているところを40に出力を変更してください。
 *
 */
const testFunction2 = () => {
  // テスト開始の合図です。
  console.log('****問題2の計算を開始します。**** ');

  // ****************この中を修正してください。***************

  let box1 = 10;
  box1 = 10 - 5 - 5;
  let box2 = 20;
  box2 = 20 - 10 - 5;
  let box3 = 50 - 25;

  // ****************************************************

  // 問題2の結果を返します。ここは触らないでください。
  console.log(box1 + box2 + box3);
  console.log('****問題2の計算を終了します。**** ');
};

// ここで実行してます。ここは触らないでください。
testFunction2();

/**
 *
 * 問題3. 今答えが30となっているところを40に出力を変更してください。
 *
 */
const testFunction3 = () => {
  // テスト開始の合図です。
  console.log('****問題3の計算を開始します。**** ');

  // ****************この中を修正してください。***************

  let box1 = 20;
  let box4 = 10;
  let box2 = box1;
  let box5 = 20;
  let box3 = box2 - box5 - box4;
  let box6 = box4 + box5;
  box6 = 0;

  // ****************************************************

  // 問題2の結果を返します。ここは触らないでください。
  console.log(box1 + box2 + box3);
  console.log('****問題3の計算を終了します。**** ');
};

// ここで実行してます。ここは触らないでください。
testFunction3();
